# Напишите ваше решение
a = float(input("A: "))
n = int(input("n: "))
c = a ** n
print(c)